id: os_guest_access_smb_disable
title: "Disable Guest Access to Shared SMB Folders"
discussion: |
  Guest access to shared Server Message Block (SMB) folders _MUST_ be disabled. 
  
  Turning off guest access prevents anonymous users from accessing files shared via SMB.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'AllowGuestAccess = 0'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-85319-2
  800-53r4:
    - IA-2
  disa_stig:
    - N/A
  srg: 
    - N/A
  cci: 
    - N/A    
  800-171r2:
    - 3.5.1
    - 3.5.2
  800-53r5:
    - IA-2
macOS:
  - "11.0"
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-171
  - cnssi-1253
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
mobileconfig: true
mobileconfig_info:
  com.apple.smb.server:
    AllowGuestAccess: false